---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.Factor
source: html/44feb9d1-75e9-2ab3-9736-c90aeddb45c3.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.Factor Property

The demand factor for this demand factor value. For example, objects 1 to 3 can have 100% demand factor.
 In the example above, the demand factor will be 1.0.

## Syntax (C#)
```csharp
public double Factor { get; set; }
```